Repository: unistra/jwt-server
Catalog: jwtserver/locale/*/LC_MESSAGES/django.po
Languages: fr

source: User %(account)s does not exist
fr: L'utilisateur %(account)s n'existe pas

source: Service "%(name)s" already exists
fr: Le service "%(name)s" existe déjà

source: LDAP account to generate a token for
fr: Compte LDAP à utiliser pour générer un jeton

source: Page not found
fr: Page non trouvée

source: Error
fr: Erreur

source: Home
fr: Accueil

source: Token for service
fr: Token pour un service

source: Admin
fr: Administration

source: Logout
fr: Déconnexion

source: Login
fr: Connexion

source: JWT Server
fr: JWT Serveur

source: Central platform for issuing JWT tokens for the Unistra ecosystem.
fr: Plateforme centrale pour l'émission de jetons JWT pour l'écosystème Unistra.

source: Connect your applications to CAS in just a few lines of code.
fr: Connectez vos applications à CAS en quelques lignes de code.

source: Discover our services
fr: Découvrez les services

source: View JWKS
fr: Voir JWKS

source: API Services Catalogue
fr: Catalogue des services API

source: This application exposes several REST endpoints to manage the complete lifecycle of your users' and services' authentication.
fr: Cette application expose plusieurs points de terminaison REST pour gérer le cycle de vie complet de l'authentification de vos utilisateurs et services.

source: Debug Mode
fr: Mode Débogage

source: VueJS Native Integration
fr: Intégration native VueJS

source: Don't waste time reinventing token management. We provide an official package maintained by the Unistra community.
fr: Ne perdez pas de temps à réinventer la gestion des jetons. Nous fournissons un package officiel maintenu par la communauté Unistra.

source: Axios interceptors preconfigured
fr: Intercepteurs Axios préconfigurés

source: Automatic token refresh management
fr: Gestion automatique du rafraîchissement des jetons

source: Compatible with Vue 2 & Vue 3 (Composition API)
fr: Compatible avec Vue 2 & Vue 3 (API composition)

source: Discover the package
fr: Découvrez le package

source: Standard Authentication
fr: Authentification Standard

source: Exchanges a standard CAS ticket for a pair of tokens (Access + Refresh). Automatically retrieves the user's LDAP attributes.
fr: Échange un ticket CAS standard contre une paire de jetons (Accès + Rafraîchissement). Récupère automatiquement les attributs LDAP de l'utilisateur.

source: Session Renewal
fr: Renouvellement de Session

source: Allows maintaining the user session active without CAS re-authentication by exchanging a valid Refresh Token for a new Access Token.
fr: Permet de maintenir la session utilisateur active sans ré-authentification CAS en échangeant un jeton de rafraîchissement valide contre un nouveau jeton d'accès.

source: Machine-to-Machine authentication system. Allows a backend service to obtain an access token for another service via an ApplicationToken.
fr: Système d'authentification Machine-to-Machine. Permet à un service backend d'obtenir un jeton d'accès pour un autre service via un ApplicationToken.

source: Service Verification
fr: Vérification de Service

source: Utility endpoint to verify the validity of a CAS ticket or the accessibility of a registered remote service.
fr: Point de terminaison utilitaire pour vérifier la validité d'un ticket CAS ou l'accessibilité d'un service distant enregistré.

source: Dummy Mode
fr: Mode Simulé

source: Authentication simulator for development environments. Only works with DEBUG=True.
fr: Simulateur d'authentification pour les environnements de développement. Ne fonctionne qu'avec DEBUG=True.
